In [ ]:
%pip install pandas

Collecting pandas
  Using cached pandas-2.3.0-cp312-cp312-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (91 kB)
Collecting numpy>=1.26.0 (from pandas)
  Using cached numpy-2.3.1-cp312-cp312-manylinux_2_28_x86_64.whl.metadata (62 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/angel-ottoni/ppgmcs/mcsm_project/.venv_moc/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /home/angel-ottoni/ppgmcs/mcsm_project/.venv_moc/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Using cached pandas-2.3.0-cp312-cp312-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (12.0 MB)
Using cached numpy-2.3.1-cp312-cp312-manylinux_2_28_x86_64.whl (16.6 MB)
Using cached pytz-2025.2-py2.py3-none-any.whl (509 kB)
Using cached tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-2.3.1 pandas-2.3.0 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd

In [2]:
import os
print(os.getcwd())

/home/angel-ottoni/ppgmcs/mcsm_project/notebooks

# **Limpeza e importação dos dados**

**1. Ler o arquivo `data/dados_A506_D_2002-12-18_2024-12-31.csv`**

**2. Tratar e converter os dados corretamente**

**3. Selecionar a coluna de precipitação, teperatura média e umidade média**

**4. Salvar um CSV limpo chamado `chuva_moc.csv`**

In [6]:
# Caminho para o arquivo com os dados brutos
file_path = '../data/raw/dados_A506_D_2002-12-18_2024-12-31.csv'

In [7]:
# Ler os dados com encoding adequado e delimitador correto
raw_df = pd.read_csv(
    file_path,
    encoding='ISO-8859-1',
    sep=';',
    skiprows=10,  # pode ajustar se necessário
    na_values=['', ' ', '-', 'NA', 'nan']
)

In [8]:
raw_df.columns

Index(['Data Medicao', 'PRECIPITACAO TOTAL, DIARIO (AUT)(mm)',
       'PRESSAO ATMOSFERICA MEDIA DIARIA (AUT)(mB)',
       'TEMPERATURA DO PONTO DE ORVALHO MEDIA DIARIA (AUT)(Â°C)',
       'TEMPERATURA MAXIMA, DIARIA (AUT)(Â°C)',
       'TEMPERATURA MEDIA, DIARIA (AUT)(Â°C)',
       'TEMPERATURA MINIMA, DIARIA (AUT)(Â°C)',
       'UMIDADE RELATIVA DO AR, MEDIA DIARIA (AUT)(%)',
       'UMIDADE RELATIVA DO AR, MINIMA DIARIA (AUT)(%)',
       'VENTO, RAJADA MAXIMA DIARIA (AUT)(m/s)',
       'VENTO, VELOCIDADE MEDIA DIARIA (AUT)(m/s)', 'Unnamed: 11'],
      dtype='object')

In [9]:
raw_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8050 entries, 0 to 8049
Data columns (total 12 columns):
 #   Column                                                   Non-Null Count  Dtype
---  ------                                                   --------------  -----
 0   Data Medicao                                             8050 non-null   object
 1   PRECIPITACAO TOTAL, DIARIO (AUT)(mm)                     7251 non-null   object
 2   PRESSAO ATMOSFERICA MEDIA DIARIA (AUT)(mB)               7609 non-null   object
 3   TEMPERATURA DO PONTO DE ORVALHO MEDIA DIARIA (AUT)(Â°C)  7607 non-null   object
 4   TEMPERATURA MAXIMA, DIARIA (AUT)(Â°C)                    7626 non-null   object
 5   TEMPERATURA MEDIA, DIARIA (AUT)(Â°C)                     7567 non-null   object
 6   TEMPERATURA MINIMA, DIARIA (AUT)(Â°C)                    7625 non-null   object
 7   UMIDADE RELATIVA DO AR, MEDIA DIARIA (AUT)(%)            7642 non-null   object
 8   UMIDADE RELATIVA DO AR, MINIMA DIARIA (AUT)(%)           7689 non-null   float64
 9   VENTO, RAJADA MAXIMA DIARIA (AUT)(m/s)                   7685 non-null   object
 10  VENTO, VELOCIDADE MEDIA DIARIA (AUT)(m/s)                7608 non-null   object
 11  Unnamed: 11                                              0 non-null      float64
dtypes: float64(2), object(10)
memory usage: 754.8+ KB

In [10]:
raw_df.shape

(8050, 12)

In [11]:
variaveis = [
    'PRECIPITACAO TOTAL, DIARIO (AUT)(mm)',
    'TEMPERATURA MEDIA, DIARIA (AUT)(Â°C)',
    'UMIDADE RELATIVA DO AR, MEDIA DIARIA (AUT)(%)'
]

In [12]:
df = raw_df[['Data Medicao'] + variaveis].copy()

In [13]:
df.columns = ['data', 'precipitacao_mm', 'temp_media', 'umidade_media']

In [14]:
df.head()

         data precipitacao_mm temp_media umidade_media
0  2002-12-18             NaN        NaN           NaN
1  2002-12-19             NaN       24,6          74,1
2  2002-12-20               0       25,3          71,2
3  2002-12-21               0       26,4          65,7
4  2002-12-22               0       26,5          63,8

In [15]:
df['data'] = pd.to_datetime(df['data'], errors='coerce')

In [16]:
df.dtypes

data               datetime64[ns]
precipitacao_mm            object
temp_media                 object
umidade_media              object
dtype: object

In [17]:
colunas_numericas = ['precipitacao_mm', 'temp_media', 'umidade_media']

for col in colunas_numericas:
    df[col] = pd.to_numeric(df[col].str.replace(',', '.'), errors='coerce')

In [18]:
print(df.dtypes)

data               datetime64[ns]
precipitacao_mm           float64
temp_media                float64
umidade_media             float64
dtype: object

In [19]:
df.head()

        data  precipitacao_mm  temp_media  umidade_media
0 2002-12-18              NaN         NaN            NaN
1 2002-12-19              NaN        24.6           74.1
2 2002-12-20              0.0        25.3           71.2
3 2002-12-21              0.0        26.4           65.7
4 2002-12-22              0.0        26.5           63.8

In [22]:
# Contar valores nulos na coluna 'precipitacao_mm'
n_nulos = df['precipitacao_mm'].isna().sum()

print(f"A coluna 'precipitacao_mm' tem {n_nulos} valores nulos.")

A coluna 'precipitacao_mm' tem 799 valores nulos.

In [44]:
df = df.dropna(subset=['data', 'precipitacao_mm', 'temp_media', 'umidade_media'])

In [45]:
df.shape

(7220, 4)

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7220 entries, 2 to 8049
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   data             7220 non-null   datetime64[ns]
 1   precipitacao_mm  7220 non-null   float64
 2   temp_media       7220 non-null   float64
 3   umidade_media    7220 non-null   float64
dtypes: datetime64[ns](1), float64(3)
memory usage: 282.0 KB

In [50]:
df = df.sort_values('data').reset_index(drop=True)

In [51]:
df.head(30)

         data  precipitacao_mm  temp_media  umidade_media
0  2002-12-20              0.0        25.3           71.2
1  2002-12-21              0.0        26.4           65.7
2  2002-12-22              0.0        26.5           63.8
3  2002-12-23              0.0        25.2           73.4
4  2002-12-24              4.0        27.2           67.3
5  2002-12-25              0.0        24.9           80.8
6  2002-12-26            131.8        23.4           84.3
7  2002-12-27             23.8        21.3           93.1
8  2002-12-28             10.6        22.3           87.0
9  2002-12-29             18.2        21.6           93.8
10 2002-12-30             18.2        21.8           90.7
11 2002-12-31             13.2        22.3           90.4
12 2003-01-01              7.0        22.8           89.3
13 2003-01-02             11.2        23.0           89.8
14 2003-01-03              7.8        22.4           93.1
15 2003-01-04             52.2        24.1           81.8
16 2003-01-05             20.8        23.0           87.1
17 2003-01-06              3.2        24.7           79.4
18 2003-01-07              1.2        23.9           85.5
19 2003-01-08              0.4        25.4           81.5
20 2003-01-09              0.0        26.3           77.3
21 2003-01-10              0.0        26.5           76.8
22 2003-01-22             21.8        22.8           85.4
23 2003-01-23              0.0        24.7           72.2
24 2003-01-24              0.0        24.5           72.1
25 2003-01-25              0.0        25.2           67.7
26 2003-01-26              0.0        24.6           68.3
27 2003-01-27              0.0        24.2           71.0
28 2003-01-28              0.0        23.6           77.7
29 2003-01-29              0.0        23.6           81.8

In [52]:
df.tail()

           data  precipitacao_mm  temp_media  umidade_media
7215 2024-12-27              0.0        26.0           60.7
7216 2024-12-28             10.6        25.0           70.2
7217 2024-12-29              1.6        23.7           74.3
7218 2024-12-30              0.0        24.7           64.1
7219 2024-12-31              0.0        22.8           75.7

In [23]:
df = df[df['data'].dt.year > 2002]

In [24]:
df['data'].dt.year.unique()

array([2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013,
       2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024],
      dtype=int32)

In [25]:
# Contar valores nulos na coluna 'precipitacao_mm'
n_nulos = df['precipitacao_mm'].isna().sum()

print(f"A coluna 'precipitacao_mm' tem {n_nulos} valores nulos.")

A coluna 'precipitacao_mm' tem 797 valores nulos.

In [56]:
df['data'].dt.year.nunique()

22

In [57]:
df.head()

         data  precipitacao_mm  temp_media  umidade_media
12 2003-01-01              7.0        22.8           89.3
13 2003-01-02             11.2        23.0           89.8
14 2003-01-03              7.8        22.4           93.1
15 2003-01-04             52.2        24.1           81.8
16 2003-01-05             20.8        23.0           87.1

In [59]:
df.to_csv('../data/chuva_moc.csv', index=False)
print('Arquivo "chuva_moc.csv" salvo com sucesso!!')

Arquivo "chuva_moc.csv" salvo com sucesso!!